import datetime
import time

print('#$%*&@!^%')
print('   r0w_')
print('#$%*&@!^%')
print('')

print('Запуск...')
time.sleep(5)
print('------------------------------------------------------')

print('Вас приветствует база данных r0w_ Inc. Пожалуйста, введите логин или пароль для доступа к ней.')
print('')
print('Пример:')
print('Логин:Пароль')
print('------------------------------------------------------')

dostup = str(input(''))

if dostup == ('r0w_:dbdonelovebitch'):
    print('------------------------------------------------------')
    print('Обработка...')
    time.sleep(5)
    print('Вход выполнен успешно.')
    time.sleep(2)
    print('------------------------------------------------------')
    print('Здравствуйте, Алан.')
    print('Ваш статус: Администратор')
    print(datetime.datetime.today().strftime(('Сегодня %d-%m-%Y года')))
    print('Спасибо что используете системы r0w_ Inc.')
    str(input('Нажмите ENTER чтобы продолжить...'))
else:
    print('------------------------------------------------------')
    print('Обработка...')
    time.sleep(5)
    print('Просим прощения, но данного сотрудника не найдено.')