import time

print('▒▒▒▒▒▒▒▒▒▒▒▒')
print('  by r0w_')
print('▒▒▒▒▒▒▒▒▒▒▒▒')
print('')

a = input('Установить Grand Theft Auto V? Y/N? ')

if a == ('Y'):
    i = 1
    while i<=100:
        print(str(i) + '%')
        i = i+1
        time.sleep(0.5)
    print('┌----------------------------┐')
    print('|Установка успешно завершена!|')
    print('└----------------------------┘')
    input('Нажми ENTER чтобы продолжить...')
    
elif a == ('N'):
    print('┌------------------------------------------------------------------┐')
    print('|Установка успешно прервана. Спасибо пользуетесь Installer от r0w_.|')
    print('└------------------------------------------------------------------┘')
    input('Нажми ENTER чтобы продолжить...')

else:
    print('Неизвестная команда.')
    input('Нажми ENTER чтобы продолжить...')
